In [1]:
import pandas as pd

In [4]:
df = pd.read_excel(r'C:\Users\hakim\OneDrive\Desktop\batch_21.xlsx')
df

                 Name         Place     Post  Salary  Age  Gender
0  Abhishek Ingulkaar          Pune       DS  345000   25    Male
1         Ashwini Gat  Ichalkaranji    Admin   45000   33  Female
2        Gaurav Desai          Pune   Tester   80000   28    Male
3      Milind Dhawale         Thane       DS  120000   23    Male
4     Prasad Ganthade       Belgaum  Manager  500000   29    Male
5         Sadia Desai         Dubai       SE  340000   31  Female
6      Shilvanti Kale        Sangli       SE   68000   23  Female
7         Reva Jagtap         Karad       DS   50000   28  Female

## fetch top 5 records

In [5]:
df.head()

                 Name         Place     Post  Salary  Age  Gender
0  Abhishek Ingulkaar          Pune       DS  345000   25    Male
1         Ashwini Gat  Ichalkaranji    Admin   45000   33  Female
2        Gaurav Desai          Pune   Tester   80000   28    Male
3      Milind Dhawale         Thane       DS  120000   23    Male
4     Prasad Ganthade       Belgaum  Manager  500000   29    Male

## fetch last 5 records

In [6]:
df.tail()

              Name    Place     Post  Salary  Age  Gender
3   Milind Dhawale    Thane       DS  120000   23    Male
4  Prasad Ganthade  Belgaum  Manager  500000   29    Male
5      Sadia Desai    Dubai       SE  340000   31  Female
6   Shilvanti Kale   Sangli       SE   68000   23  Female
7      Reva Jagtap    Karad       DS   50000   28  Female

## fetch name column

In [8]:
df.Name #==> Series

0    Abhishek Ingulkaar
1           Ashwini Gat
2          Gaurav Desai
3        Milind Dhawale
4       Prasad Ganthade
5           Sadia Desai
6        Shilvanti Kale
7           Reva Jagtap
Name: Name, dtype: object

In [9]:
df['Name']#==> Series

0    Abhishek Ingulkaar
1           Ashwini Gat
2          Gaurav Desai
3        Milind Dhawale
4       Prasad Ganthade
5           Sadia Desai
6        Shilvanti Kale
7           Reva Jagtap
Name: Name, dtype: object

In [10]:
df[['Name']] #==> DF

                 Name
0  Abhishek Ingulkaar
1         Ashwini Gat
2        Gaurav Desai
3      Milind Dhawale
4     Prasad Ganthade
5         Sadia Desai
6      Shilvanti Kale
7         Reva Jagtap

## Create 2 new columns for firstname and Last name

In [13]:
df.Name.str.split(' ',expand=True)

           0          1
0   Abhishek  Ingulkaar
1    Ashwini        Gat
2     Gaurav      Desai
3     Milind    Dhawale
4     Prasad   Ganthade
5      Sadia      Desai
6  Shilvanti       Kale
7       Reva     Jagtap

In [15]:
s = pd.Series(['ABC-123','PQR-456'])
s

0    ABC-123
1    PQR-456
dtype: object

In [16]:
s.str.split('-',expand=True)

     0    1
0  ABC  123
1  PQR  456

In [19]:
s = pd.Series(['ABC-123','PQR:456'])
s

0    ABC-123
1    PQR:456
dtype: object

In [21]:
s.str.replace(':','-').str.split('-',expand=True)

     0    1
0  ABC  123
1  PQR  456

## Select name and salary columns

In [22]:
df[['Name','Salary']]

                 Name  Salary
0  Abhishek Ingulkaar  345000
1         Ashwini Gat   45000
2        Gaurav Desai   80000
3      Milind Dhawale  120000
4     Prasad Ganthade  500000
5         Sadia Desai  340000
6      Shilvanti Kale   68000
7         Reva Jagtap   50000

In [27]:
# u can alter sequence
df[['Salary','Name','Age']]

   Salary                Name  Age
0  345000  Abhishek Ingulkaar   25
1   45000         Ashwini Gat   33
2   80000        Gaurav Desai   28
3  120000      Milind Dhawale   23
4  500000     Prasad Ganthade   29
5  340000         Sadia Desai   31
6   68000      Shilvanti Kale   23
7   50000         Reva Jagtap   28

In [28]:
# if we have so many columns then to avoid mistakes and to make work simple
# check column list
df.columns

Index(['Name', 'Place', 'Post', 'Salary', 'Age', 'Gender'], dtype='object')

## access 'Name', 'Place', 'Post'

In [ ]:
#to select multiple columns
#we can use loc: location based selection/ label based selection

In [29]:
# syntax: df.loc[:,:] ==>[rows,columns]
# stop in loc is inclusive
df.loc[:,'Name':'Post']

                 Name         Place     Post
0  Abhishek Ingulkaar          Pune       DS
1         Ashwini Gat  Ichalkaranji    Admin
2        Gaurav Desai          Pune   Tester
3      Milind Dhawale         Thane       DS
4     Prasad Ganthade       Belgaum  Manager
5         Sadia Desai         Dubai       SE
6      Shilvanti Kale        Sangli       SE
7         Reva Jagtap         Karad       DS

In [33]:
#access name and gender column

df.loc[:,:'Gender':5]

                 Name  Gender
0  Abhishek Ingulkaar    Male
1         Ashwini Gat  Female
2        Gaurav Desai    Male
3      Milind Dhawale    Male
4     Prasad Ganthade    Male
5         Sadia Desai  Female
6      Shilvanti Kale  Female
7         Reva Jagtap  Female

In [36]:
# Reverse columns
df.loc[:,::-1]

   Gender  Age  Salary     Post         Place                Name
0    Male   25  345000       DS          Pune  Abhishek Ingulkaar
1  Female   33   45000    Admin  Ichalkaranji         Ashwini Gat
2    Male   28   80000   Tester          Pune        Gaurav Desai
3    Male   23  120000       DS         Thane      Milind Dhawale
4    Male   29  500000  Manager       Belgaum     Prasad Ganthade
5  Female   31  340000       SE         Dubai         Sadia Desai
6  Female   23   68000       SE        Sangli      Shilvanti Kale
7  Female   28   50000       DS         Karad         Reva Jagtap

In [38]:
# slicing we use only when we want to access something sequentially
# but if i want to access random columns using loc
df.loc[:,['Place','Name','Age']]

          Place                Name  Age
0          Pune  Abhishek Ingulkaar   25
1  Ichalkaranji         Ashwini Gat   33
2          Pune        Gaurav Desai   28
3         Thane      Milind Dhawale   23
4       Belgaum     Prasad Ganthade   29
5         Dubai         Sadia Desai   31
6        Sangli      Shilvanti Kale   23
7         Karad         Reva Jagtap   28

In [44]:
# I want salary of Gaurav
g_data = df[df.Name == 'Gaurav Desai']
g_data # data of gaurav

           Name Place    Post  Salary  Age Gender
2  Gaurav Desai  Pune  Tester   80000   28   Male

In [46]:
g_data.Salary

2    80000
Name: Salary, dtype: int64

In [51]:
# if we want data of gaurav and Milind together
df[(df.Name == 'Gaurav Desai') | (df.Name == 'Milind Dhawale')]

             Name  Place    Post  Salary  Age Gender
2    Gaurav Desai   Pune  Tester   80000   28   Male
3  Milind Dhawale  Thane      DS  120000   23   Male

In [52]:
final  = df[(df.Name == 'Gaurav Desai') | (df.Name == 'Milind Dhawale')]
final[['Name','Salary']]

             Name  Salary
2    Gaurav Desai   80000
3  Milind Dhawale  120000

## Find out Name and Salary for employee salary > 80000

In [55]:
df[df.Salary> 80000]

                 Name    Place     Post  Salary  Age  Gender
0  Abhishek Ingulkaar     Pune       DS  345000   25    Male
3      Milind Dhawale    Thane       DS  120000   23    Male
4     Prasad Ganthade  Belgaum  Manager  500000   29    Male
5         Sadia Desai    Dubai       SE  340000   31  Female

In [56]:
df[df.Salary> 80000][['Name','Salary']]

                 Name  Salary
0  Abhishek Ingulkaar  345000
3      Milind Dhawale  120000
4     Prasad Ganthade  500000
5         Sadia Desai  340000

## fetch persons working in pune having salary greater than 100000

In [61]:
pn = df[df.Place == 'Pune']
pn

                 Name Place    Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune      DS  345000   25   Male
2        Gaurav Desai  Pune  Tester   80000   28   Male

In [63]:
pn[pn.Salary > 100000]

                 Name Place Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune   DS  345000   25   Male

In [67]:
df[(df.Place == "Pune" )& (df.Salary > 100000)]

                 Name Place Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune   DS  345000   25   Male

### We can get same answer using query()

In [68]:
#df.query(str)
df.query('Place == "Pune" & Salary > 100000')

                 Name Place Post  Salary  Age Gender
0  Abhishek Ingulkaar  Pune   DS  345000   25   Male

## Fetch an an employee whose salary is Max

In [69]:
df.Salary.max()

500000

In [71]:
df[df.Salary == 500000]

              Name    Place     Post  Salary  Age Gender
4  Prasad Ganthade  Belgaum  Manager  500000   29   Male

## who is from Thane location

In [76]:
df.query('Place == "Thane"').Name

3    Milind Dhawale
Name: Name, dtype: object